
#### Terraform Plan 📖`success`

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.my_ec2 will be created
  + resource "aws_instance" "my_ec2" {
      + ami                                  = "ami-053e5b2b49d1b2a82"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "terraform-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = [
          + "allow_ssh",
        ]
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "Terraform-EC2"
        }
      + tags_all                             = {
          + "Name" = "Terraform-EC2"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device (known after apply)
    }

  # aws_key_pair.my_key will be created
  + resource "aws_key_pair" "my_key" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "terraform-key"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDuVmC3IKwdCotGEWpczBuiMI5I2eZtnjy6IHOfY1imQtUSdp71keh17NQ2lnvjm0DNkRUh2sh8DXF9hVKgJhJeLZBeJu0+l+SyFZe470KEc4NiRchl5mSoZo8Hzo+hwCc+XG7S4ExyW6z6VV69cB1D0WQMKNzXdWSAvUsHO9GOjs9oPY8ToDjbykB1VDBIYYVUE3DX/7ysPITcVaeo6tRnAKunZCQ3xHKOrWLkJpdI/1K8p7/+wVwETPnhOjtJURocSVYcGYZRK1rYQV0yhetWsBt3eSFVhenEY74mAoEM7bw6yOvL6eCmn2SEY+QaZQCb8DsZQSQ9Er+67xSsdNeef8vJcJN1qXBkDJvl4sYAbvKsTYn5RZ06auKkBntfh2SvVuY6l0eihbqDotlsFLPZIlchmE988zrJTs3LBgbDDogCs55Jk+4UvdTAO6AdnBG5vSu8UgnfPsMsiIOgllMPw5n2eSbP3HyfhMFKPA4BmiQO4GBg0Q7hRUnnS047qMbAxp3Bpq2u0WIy4vCwyFlN2IVxNdq9btOjhNdyBtx7iQSx3hpxhFSK2Pm0k6MaBhmHsdcg6ZVG/TpDtQUbvo4XFBleXuJ6IDYVUC+1YN4goNIxwi+xywwUwKjsraGSEKQ6kzpgdXYFbbjukmDiXwuMg8/AZ9YbxgCB8nwQXQvyVw== rj@rjparaiso"
      + tags_all        = (known after apply)
    }

  # aws_security_group.ssh_access will be created
  + resource "aws_security_group" "ssh_access" {
      + arn                    = (known after apply)
      + description            = "Allow SSH inbound traffic"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
                # (1 unchanged attribute hidden)
            },
        ]
      + name                   = "allow_ssh"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + public_ip = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

*Pushed by: @ThisIs-RJP, Action: `pull_request`*